#include<stdio.h>
int main()
{
	int a,b,c,d,e,f,g,sum;
	a=0;
	b=0;
	c=0;
	d=0;
	e=0;
	f=0;
	g=0;
	printf("在本游戏中，回答是请按1，否请按0，回答后请按回车键\n"); 
	printf("请在脑海中想一个1~60的数字，最好用笔写下来\n");
	scanf("%d",&a); 
	if(a==1)
    printf("想好了吗？\n");
    scanf("%d",&a); 
	if(a==1)
    printf("好\n1 11 21 31 41 51\n3 13 23 33 43 53\n5 15 25 35 45 55\n7 17 27 37 47 57\n9 19 29 39 49 59\n");
	printf("这里有你想的数字吗？\n");
	scanf("%d",&a);
	if(a==1)
	b=1;
	printf("en...\n2 11 22 31 42 51\n3 14 23 34 43 54\n6 15 26 35 46 55\n7 18 27 38 47 58\n10 19 30 39 50 59\n");
	printf("这里有你想的数字吗？\n");
	scanf("%d",&a);
	if(a==1)
	c=2;
	printf("很好！请看这一组~\n4 13 22 31 44 53\n5 14 23 36 45 54\n6 15 28 37 46 55\n7 20 29 38 47 60\n12 21 30 39 52\n");
	scanf("%d",&a);
	if(a==1)
	d=4;
	printf("嗯~那么现在我想知道你是汉子还是妹子呢？\n1.汉子   2.妹子\n");
	scanf("%d",&a);
	if(a==1)
	printf("嗯~~祝你早日找到女朋友....\n");
	else
	printf("妹妹，有男朋友吗？你看我怎么样啊？");
	scanf("%d",&a);
	if(a==0)
	printf("好吧，咱们继续看题...");
	else
	printf("嘿嘿嘿，如果我猜对了，咱俩认识一下哈~\n");
	printf("8 13 26 31 44 57\n9 14 27 40 45 58\n10 15 28 41 46 59\n11 24 29 42 47 60\n12 25 30 43 56\n");
	printf("哦，告诉我，这里有你想的数字吗？\n");
	scanf("%d",&a);
	if(a==1)
	e=8;
	printf("继续\n16 21 26 31 52 57\n17 22 27 48 53 58\n18 23 28 49 54 59\n19 24 29 50 55 60\n20 25 30 51 56\n");
	printf("en 朋友，告诉我，这里有你想的数字吗？\n");
	scanf("%d",&a);
	if(a==1)
	f=16;
	printf("OK!最后一组啦！\n32 37 43 47 52 57\n33 38 43 48 53 58\n34 39 44 49 54 59\n35 40 45 50 55 60\n36 41 46 51 56\n");
    printf("现在！靓仔，告诉我，这里有你想的数字吗？\n");
	scanf("%d",&a);
	if(a==1)
	g=32;
	sum=b+c+d+e+f+g;
	printf("好嘞，现在我已经看透你的心思，刚才问你的都是废话哈哈哈\n当然不包括我们交朋友那件事啊");
	printf("你\n想不想知道我在你心里读出来的数呢？\n");
	scanf("%d",&a);
	if(a==1)
	printf("别着急，先让我思考一下\n");
	scanf("%d",&a);
	if(a==1)
	printf("我感觉你写的数字是%d\n我猜对了吗？\n",sum);
	scanf("%d",&a);
	if(a==1)
	printf("哈哈哈，我厉害吧！\n谢谢体验\nHope to see you again~\nGAMEOVER\n");
	else
	printf("啊？？？真的吗，好吧，我可能还需要进步，没关系，我会努力哒！\nGAME OVER\n"); 
	return 0; 
}
